# AnalyticalMemberInstability Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AnalyticalModelFailures..::..AnalyticalMemberInstability Property
BuiltInFailures..::..AnalyticalModelFailures Class See Also
---
Possible Member Instability, based on Release Conditions
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId AnalyticalMemberInstability { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AnalyticalMemberInstability As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ AnalyticalMemberInstability {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace